; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	thermograph1 - mode
	infrared3 - mode
	image2 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star6 - direction
	Star10 - direction
	GroundStation7 - direction
	Star3 - direction
	GroundStation5 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation9)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation9)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
)
(:goal (and
	(have_image Planet12 thermograph1)
	(have_image Star13 thermograph0)
	(have_image Planet14 thermograph1)
	(have_image Star15 image2)
	(have_image Star16 thermograph1)
	(have_image Phenomenon17 thermograph1)
	(have_image Star18 image2)
))

)

; plan
1. (turn_to satellite0 groundstation11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation11)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation11)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 star18 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 star18)
   goals met: 0 of 7
5. (take_image satellite0 star18 instrument0 image2)
   added: (have_image star18 image2)
   goals met: 1 of 7
6. (turn_to satellite0 star15 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star15)
   goals met: 1 of 7
7. (take_image satellite0 star15 instrument0 image2)
   added: (have_image star15 image2)
   goals met: 2 of 7
8. (turn_to satellite0 groundstation9 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation9)
   goals met: 2 of 7
9. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 7
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 7
11. (calibrate satellite0 instrument1 groundstation9)
   added: (calibrated instrument1)
   goals met: 2 of 7
12. (turn_to satellite0 phenomenon17 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 7
13. (take_image satellite0 phenomenon17 instrument1 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 3 of 7
14. (turn_to satellite0 planet12 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet12)
   goals met: 3 of 7
15. (take_image satellite0 planet12 instrument1 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 4 of 7
16. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 4 of 7
17. (take_image satellite0 planet14 instrument1 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 5 of 7
18. (turn_to satellite0 star13 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star13)
   goals met: 5 of 7
19. (take_image satellite0 star13 instrument1 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 6 of 7
20. (turn_to satellite0 star16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star16)
   goals met: 6 of 7
21. (take_image satellite0 star16 instrument1 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 7 of 7
